package HeiMa;

/*

◆数组定义格式
◆数组初始化之动态初始化
◆数组元素访问
◆内存分配
◆数组初始化之静态初始化
◆数组操作的两个常见小问题
◆>数组常见操作

1.1 数组定义
    一次性声明大量的用于存储数据的变量
    要存储的数据通常都是同类型数据，例如:考试成绩

1.2什么是数组
    数组(array)是一种用于存储多个相同类型数据的存储模型

1.3数组的定义格式
    ●格式一:数据类型[]变量名
        ●范例:int[] arr
        定义了一个int类型的数组，数组名是arr


    ●格式二: 数据类型变量名[]
        ●范例:int  arr[]
        定义了一个int类型的变量，变量名是arr数组


    使用没有区别  读的时候有区别
    推荐使用格式一

*/


public class a058_ShuZuDingYiGeShi {
    public static void main(String[] args) {

    }
}
