package HeiMa;

/**
 * @Author Miracle Liuce
 * @Date 2021/10/24 16:54
 * @Version 1.0
 *

 5.2方法的通用格式
    格式  public static 返回值类型  方法名(参数){
                方法体;
                return 数据;
        }

        public static      修饰符
        返回值类型          方法操作完毕之后返回的得数据类型
                           如果方法操作完毕，没有数据返回，这里写  void  而且方法体中一般不写 return
        方法名              调用方法时候使用的标识
        参数                由数据类型和变量名组成，多个参数之间用逗号隔开
        方法体              完成功能的代码块
        return              如果方法操作完毕，有数据返回，用于把数据返回给调用者


    定义方法时，要做到两个明确
        明确返回值类型:主要是明确方法操作完毕之后是否有数据返回，
                      如果没有，写void; 如果有,写对应的数据类型
        明确参数:主要是明确参数的类型和数量

    调用方法时
        void类型的方法，直接调用即可
        非void类型的方法，推荐用变量接收调用



 */

public class a079_FangFaDeTongYongGeShi {

}
