package HeiMa;

/**
 * @Author Miracle Liuce
 * @Date 2021/10/26 11:34
 * @Version 1.0

0案例:百钱百鸡
需求:我国古代数学家张丘建在《算经》-书中提出的数学问题:
鸡翁-值钱五, 鸡母值钱三，鸡雏三值钱一。
百钱买百鸡，问鸡翁、鸡母、鸡雏各几何?


数量
鸡翁  i
鸡母  j
鸡雏  k


价格
鸡翁  1.5
鸡母  1.3
鸡雏  3.1


1.5*i+1.3*j+3.1*k=100

 i+j+k=100


分析:
    假设鸡翁x只，鸡母y只，鸡雏z只，则下面的式
    子是成立的.
    x +y+ z= 100;
    5*x+ 3*y+z/3= 100;
    如果单独只看- -种鸡型，则下面的式子是成立的
    0<=x<=20
    0<=y<=33
    0<=z<=100
    使用究举法就可以罗列出x，y, z的值。


思路:
    ①第1层循环，用于表示鸡翁的范围，初始化表达式的变量定义为x=0,判断条件是x<=20
    ②第2层循环，用于表示鸡母的范围，初始化表达式的变量定义为y=0,判断条件是y<=33
    ③这个时候，用于表示鸡雏的变量z= 100-x-y
    ④判断表达式z%3==0和表达式5*x+ 3*y+ z/3 = 100是否同时成立，如果成立，输出对应的x，y, z的值,
    就是对应的鸡翁，鸡母,鸡雏的值



 */

public class a093_BaiQianBaiJi {
    public static void main(String[] args) {

    //①第1层循环，用于表示鸡翁的范围，初始化表达式的变量定义为x=0,判断条件是x<=20
    for (int x=0;x<20;x++){
        //②第2层循环，用于表示鸡母的范围，初始化表达式的变量定义为y=0,判断条件是y<=33
        for (int y=0;y<33;y++){
            //③这个时候，用于表示鸡雏的变量z= 100-x-y
            int z=100-x-y;

            //④判断表达式z%3==0和表达式5*x+ 3*y+ z/3 = 100是否同时成立
            if (z%3==0 && 5*x+3*y+z/3==100){
                System.out.println(x+","+y+","+z);
            }


        }
    }

/*
        for (int i=0;i<100;i++){
            for (int j=0;j<100;j++){
                for (int k=0;k<100;k++){
                    if ((5*i)+(3*j)+(k/3)==100 && i+j+k==100 ){
                        System.out.println(" i: "+i+" j: "+j+" k: "+k);
                    }
                }
            }
        }
*/


    }
}
