package HeiMa.a234_ShuJuJieGouZhiShuZuHeLianBiao;

/**
 * @author ：LC
 * @date ： 2021/11/25 19:25

2.9常见数据结构之数组
    数组是一种查询快，增删慢的模型

    查询数据通过索引定位，查询任意数据耗时相同，查询效率高
    删除数据时，要将原始数据删除，同时后面每个数据前移，删除效率低
    添加数据时，添加位置后的每个数据后移,再添加元素，添加效率极低

2.10常见数据结构之链表
    链表是由结点组成的 ，链表的每个元素称为结点
    结点的结构

    地址
    数据 地址

        数据上方的地址：结点的存储位置
        数据：存储具体的数据
        数据后方的地址：下一个结点的位置

    头结点的结构

    head ^

        ^ 表示 结点指向空地址 （表示结束 ）


    链表是一种增删快的模型(对比数组)
    链表是一种查询慢的模型(对比数组)
    查询数据D是否存在，必须从头(head)开始查询
    查询第3个数据，必须从头(head)开始查询


 */
public class Demo {
    public static void main(String[] args) {

    }
}
